import React from 'react'
import "./myAds.css"
import Card from '../../Categories/components/Card'
const MyAds = () => {
    const featuresColumn = [
        [
            {
                "icon": "",
                "text1": "בית קפה",
                "text2": "סוג"
            }
        ]
    ]
    return (
        <div className='myAds'>
            <h1>מודעות  שלי</h1>
            <div className="myAds-cards">
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
                <Card
                    image="Card-business"
                    heading="🔥 מסעדה רווחית 1.5 מיליון בשנה"
                    title1="לפני 6 ימים"
                    title2="פתח תקווה"
                    featureColumns={featuresColumn}
                    buttonText=" פרטים נוספים  "
                    text1="מסעדה כשרה רווחית כ-1.5 מיליון בשנה. פעילה 5 ימים בשבוע ומוצש. מושקעת כ-4.5 מיליון שח. מחזור שנתי כ-8-10 מיליון. רישיון עסק. בעלים פעיל בניהול מלמעלה בלבד. צוות "
                    text2={[
                        "מחיר",
                        " ₪680,000"
                    ]}
                    productId={4}
                />
            </div>

        </div>
    )
}

export default MyAds