import React from 'react'
import "./deliveryHelp.css"
import { GrLinkNext } from 'react-icons/gr';

const DeliveryHelp = () => {
    return (
        <div className='deliveryHelp'>
            <button><GrLinkNext />חזרה</button>
            <h1>מידע על השילוח</h1>
            <h3>שירותיי משלוחים</h3>
            <p>(שם האתר ) הוא האתר הראשון בארץ שהוציא שירותיי משלוחים של מוצרי יד שנייה  בין לקוחות פרטיים.</p>
            <p>ברשותנו חברות שילוח מהגדולות בארץ על מנת לספק את השירות הטוב ביותר ללקוח. </p>
            <h3>איך לבצע הזמנת משלוח?</h3>
            <p>על מנת לבצע הזמנת משלוח ברשותכם שתי אופציות לביצוע התהליך.  </p>
            <h3>אופציה ראשונה:</h3>
            <p>האופציה הראשונה שלכם היא בחירת אמצעי תשלום דרך האתר על מנת למנוע הונאות עתידיות.</p>
            <p>ובכך אתם מוגנים משני הצדדים (לקוח , מוכר)  בזכות המערכת המתקדמת שלנו. </p>
            <h3>אופציה שנייה:</h3>
            <p>האופציה השנייה שלכם היא ביצוע הזמנה דרכנו התנהלות פרטית בין הלקוח למוכר</p>
            <p>כך שאמצעי תשלום מנוהלים על ידכם בלבד.</p>
            <h2>שלחתי מוצר ולא קיבלתי את הכסף</h2>
            <h3>במידה ובחרתם באופציה הראשונה:</h3>
            <p>כספכם ישלח אליכם ל(לאן שזה אמור להישלח) עד 24 שעות ממועד ביצוע מלא של השילוח (שליחה ומסירה).</p>
            <h3>במידה ובחרתם באופציה השנייה:</h3>
            <p>על אחריותכם בלבד התנהלות הכספית בין הקונה למוכר אנא היזהרו מהונאות וזיופים ברשת </p>
            <div className="deliveryHelp-btn">
                <div>
                    <h1>עדיין צריך עזרה?</h1>
                    <h3>אנחנו תמיד כאן בשבילך.</h3>
                </div>
                <button>בואו נדבר!</button>
            </div>
        </div>
    )
}

export default DeliveryHelp